packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "extmem_manager.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
// #include "stm32n6570_discovery_xspi.h"
// #include "stm32n6570_discovery_errno.h"
#include "stm32n6570_discovery.h"    /* BSP: COM1 VCP UART + LEDs (board-canonical) */
// #include "stm32n6xx_hal_bsec.h"
// #include "stm32n6xx_hal_ramcfg.h"
// #include "llm_fsbl.h"
// #include "llm_test_fsbl.h"
// #include "npu_init.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

RAMCFG_HandleTypeDef hramcfg_SRAM1;
RAMCFG_HandleTypeDef hramcfg_SRAM2;
RAMCFG_HandleTypeDef hramcfg_SRAM3;
RAMCFG_HandleTypeDef hramcfg_SRAM4;
RAMCFG_HandleTypeDef hramcfg_SRAM5;
RAMCFG_HandleTypeDef hramcfg_SRAM6;

UART_HandleTypeDef huart1;

XSPI_HandleTypeDef hxspi1;
XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
COM_InitTypeDef BspCOMInit;

volatile int debugFlag = 0;  /* 1 = spin in catch loop for MCP GDB attach + release (methodology). */
volatile uint32_t g_boot_stage = 0;  /* init progress marker — read via GDB to localize a stall/error */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_XSPI1_Init(void);
static void MX_XSPI2_Init(void);
static void MX_BSEC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_RAMCFG_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static void Enable_NPU_RAM_ForCore(void);
static void Enable_AXICACHE_RAM_ForCore(void);
static void OpenDebug(void);
// void LLM_Repl_Run(void);   /* interactive NPU grammar REPL (llm_repl.cpp) */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* Direct-register USART1 TX — HAL_UART_Transmit fails silently in the FSBL boot context
 * (HAL_GetTick may not advance), per reference N6_EDGEAI_1. Poll ISR.TXFNF (bit 7), write TDR. */
// static void uart1_putc(char c)
// {
//     while ((USART1->ISR & (1u << 7)) == 0) { __NOP(); }
//     USART1->TDR = (uint32_t)(uint8_t)c;
// }
// static void uart_puts(const char *s)
// {
//     if (USART1->CR1 == 0U) return;   /* UART not initialised yet */
//     for (; *s; ++s) uart1_putc(*s);
// }

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* RAM-bank power-on for the M55 core — BEFORE any code touches AXISRAM3-6 / CACHEAXIRAM
   * (boot ROM parks them; first access faults). Ref project N6_EDGEAI_1 main(). */
  // Enable_NPU_RAM_ForCore();
  // Enable_AXICACHE_RAM_ForCore();

  /* Re-authorize Secure SWD core debug (runtime BSEC, no OTP) so the MCP GDB session can
   * attach to the running FSBL. Ref N6_EDGEAI_1. REMOVE for production. */
  OpenDebug();

  /* GDB catch loop (debugFlag technique — methodology-debug-fsbl-direct + ref N6_EDGEAI_1):
   * CPU spins here after OpenDebug. MCP flow: gdb_server_start(attach) -> connect -> CPU is
   * in this loop -> release via write M[&debugFlag]=0 + DCIMVAC + resume -> step. */
  while (debugFlag) { __NOP(); }

  /* Force-disable MPU first: BootROM/leftover FSBL state may leave XN regions that fault
   * instruction fetch in our load range. Ref N6_EDGEAI_1. */
  HAL_MPU_Disable();

  /* Suppress the BootROM "unsigned-boot" RED LED (LD2 = PG10, active-low): under SWD
   * load_and_run the ROM drives PG10 LOW (LED ON) as a debug signal; a BSRR set-bit flips
   * it HIGH (OFF). Ref N6_EDGEAI_1. */
  __HAL_RCC_GPIOG_CLK_ENABLE();
  GPIOG->BSRR = (1U << 10);

  /* Clear stale pending IRQs the boot ROM / prior boot leave — they re-fire right after
   * load_and_run and fault into uninitialised HAL state. Ref N6_EDGEAI_1. */
  HAL_NVIC_DisableIRQ(TIM2_IRQn);
  HAL_NVIC_ClearPendingIRQ(TIM2_IRQn);
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* NPU RAMs were powered in USER CODE 1; enable the M55 caches. */
  // SystemInit_POST();
  // SCB_EnableICache();
  // SCB_EnableDCache();
  g_boot_stage = 3;
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_XSPI1_Init();
  MX_XSPI2_Init();
  MX_BSEC_Init();
  MX_USART1_UART_Init();
  MX_RAMCFG_Init();
  SystemIsolation_Config();
  // MX_EXTMEM_MANAGER_Init();
  /* USER CODE BEGIN 2 */
  // NPU_Config();
  g_boot_stage = 4;

  /* NPU weights are memory-mapped from XSPI2 NOR @0x71000000 */
  // BSP_XSPI_NOR_Init_t xspiInit;
  // xspiInit.InterfaceMode = MX66UW1G45G_OPI_MODE;
  // xspiInit.TransferRate  = MX66UW1G45G_DTR_TRANSFER;
  // BSP_XSPI_NOR_Init(0, &xspiInit);
  // BSP_XSPI_NOR_EnableMemoryMappedMode(0);
  g_boot_stage = 5;

  // RISAF_Config();
  g_boot_stage = 6;

